In [227]:
import pandas as pd

In [228]:
data=pd.read_csv("hiring.csv")
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [229]:
from word2number import w2n

In [230]:
print(w2n.word_to_num('twenty one'))

21

In [231]:
data.experience=data.experience.fillna("zero")
data["test_score(out of 10)"]=data["test_score(out of 10)"].fillna(data["test_score(out of 10)"].median())

In [232]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [241]:
data["exp"]=data["experience"]

In [242]:
for i in range(0,len(data.experience)):
    data.exp[i]=w2n.word_to_num(data.experience[i])
data

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  experience  test_score(out of 10)  interview_score(out of 10)  salary($) exp
0       zero                    8.0                           9      50000   0
1       zero                    8.0                           6      45000   0
2       five                    6.0                           7      60000   5
3        two                   10.0                          10      65000   2
4      seven                    9.0                           6      70000   7
5      three                    7.0                          10      62000   3
6        ten                    8.0                           7      72000  10
7     eleven                    7.0                           8      80000  11

In [243]:
data.drop(["experience"],axis=1)

   test_score(out of 10)  interview_score(out of 10)  salary($) exp
0                    8.0                           9      50000   0
1                    8.0                           6      45000   0
2                    6.0                           7      60000   5
3                   10.0                          10      65000   2
4                    9.0                           6      70000   7
5                    7.0                          10      62000   3
6                    8.0                           7      72000  10
7                    7.0                           8      80000  11

In [244]:
 from sklearn import linear_model

In [245]:
lr=linear_model.LinearRegression()

In [250]:
lr.fit(data[["exp","test_score(out of 10)","interview_score(out of 10)"]],data["salary($)"])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [251]:
lr.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [252]:
lr.intercept_

17737.263464337695

In [254]:
lr.predict([[5,9,6]])

array([61644.83260553])